Revit 2015 API
PathReinforcement.AdditionalOffset Property
 Additional offset
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
public double AdditionalOffset { get; set; }
Visual Basic
Public Property AdditionalOffset As Double
	Get
	Set
Visual C++
public:
property double AdditionalOffset {
	double get ();
	void set (double value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The given value for offset must be no more than 30000 feet in absolute value.
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
See Also
PathReinforcement Class
Autodesk.Revit.DB.Structure Namespace